## Ejemplo: Datos de los Estados de EE.UU.

Las operaciones merge y join aparecen con más frecuencia cuando se combinan datos de distintas fuentes.
Aquí consideraremos un ejemplo de algunos datos sobre los estados de EE.UU. y su población.
Los archivos de datos se encuentran en http://github.com/jakevdp/data-USstates/:

In [1]:
import pandas as pd
import numpy as np

C:\Users\Jonatan\AppData\Local\Temp\ipykernel_7692\2162656668.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

Echemos un vistazo a los tres conjuntos de datos, utilizando la función Pandas ``read_csv()``:

In [2]:
pop = pd.read_csv('data/state-population.csv')
areas = pd.read_csv('data/state-areas.csv')
abbrevs = pd.read_csv('data/state-abbrevs.csv')

In [4]:
# Los siguientes son comandos shell para descargar los datos
#!curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-population.csv
# !curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-areas.csv
# !curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-abbrevs.csv

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed

  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
100 57935  100 57935    0     0   149k      0 --:--:-- --:--:-- --:--:--  150k

In [5]:
pop.head()

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

In [6]:
areas.head()

        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

In [8]:
pop.head()

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

In [9]:
pop.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2544 entries, 0 to 2543
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   state/region  2544 non-null   object
 1   ages          2544 non-null   object
 2   year          2544 non-null   int64
 3   population    2524 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 79.6+ KB

In [7]:
abbrevs.head()

        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

Con esta información, supongamos que queremos calcular un resultado relativamente sencillo: clasificar los estados y territorios de EE.UU. según su densidad de población en 2010.
Es evidente que disponemos de los datos necesarios para obtener este resultado, pero tendremos que combinar los conjuntos de datos para obtenerlo.

Empezaremos con una combinación múltiple que nos dará el nombre completo del estado dentro del ``DataFrame`` de población.

Queremos hacer la combinación basándonos en la columna ``state/region`` de ``pop`` y en la columna ``abbreviation`` de ``abbrevs``.

Utilizaremos ``how='outer'`` para asegurarnos de que no se pierde ningún dato por no coincidir las etiquetas.

In [45]:
merged = pd.merge(pop, abbrevs, how='outer',
                  left_on='state/region', right_on='abbreviation', indicator=True)
merged = merged.drop('abbreviation', axis=1) # drop duplicate info
merged.head()

  state/region     ages  year  population   state _merge
0           AK    total  1990    553290.0  Alaska   both
1           AK  under18  1990    177502.0  Alaska   both
2           AK    total  1992    588736.0  Alaska   both
3           AK  under18  1991    182180.0  Alaska   both
4           AK  under18  1992    184878.0  Alaska   both

Comprobemos si se ha producido alguna discordancia, lo que podemos hacer buscando filas con nulos para ello usamos el método any().

any() vs all()

In [11]:
### any() y all()
ejemplo = pd.Series([1, 5, 6, np.nan, 4, 5])

In [12]:
# ¿Alguno es no nulo?
ejemplo.notnull().any()

True

In [13]:
# ¿Alguno es nulo?
ejemplo.isnull().any()

True

In [14]:
# Todos son no nulos?
ejemplo.notnull().all()

False

In [15]:
# Todos son nulos?
ejemplo.isnull().all()

False

In [17]:
### any() y all()
ejemplo2 = pd.Series([1, 5, 6, 5, 4, 5])

In [18]:
# Alguno es no nulo?
ejemplo2.notnull().any()

True

In [19]:
# Alguno es  nulo?
ejemplo2.isnull().any()

False

In [20]:
# Todos son no nulo?
ejemplo2.notnull().all()

True

In [21]:
# Todos son nulos?
ejemplo2.isnull().all()

False

In [22]:
# ejemplo3 podría ser una columna vacia
ejemplo3 = pd.Series([np.nan, np.nan])

In [23]:
# ¿Alguno es no nulo?
ejemplo3.notnull().any()

False

In [24]:
# Todos son no nulo?
ejemplo3.notnull().all()

False

In [25]:
# ¿Alguno es nulo?
ejemplo3.isnull().any()

True

In [26]:
# ¿Todos son nulos?
ejemplo3.isnull().all()

True

In [27]:
### any() y all()
ejemplo4 = pd.Series([1, 5, 6, 8, 4, 5])

In [28]:
(ejemplo4>4).any()

True

In [29]:
(ejemplo4>4).all()

False

In [30]:
(ejemplo4<10).any()

True

In [31]:
(ejemplo4<10).all()

True

In [33]:
# any() busca algún True en una columna
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
_merge          False
dtype: bool

In [34]:
# all() busca algún True en una columna
merged.isnull().all()

state/region    False
ages            False
year            False
population      False
state           False
_merge          False
dtype: bool

Algunos de los datos de ``población`` son nulos; ¡averigüemos cuáles son!

In [46]:
merged[merged['population'].isnull()].head()

     state/region     ages  year  population state     _merge
1872           PR  under18  1990         NaN   NaN  left_only
1873           PR    total  1990         NaN   NaN  left_only
1874           PR    total  1991         NaN   NaN  left_only
1875           PR  under18  1991         NaN   NaN  left_only
1876           PR    total  1993         NaN   NaN  left_only

In [47]:
# Usando la variable indicator
merged[merged['_merge']!="both"]

     state/region     ages  year   population state     _merge
1872           PR  under18  1990          NaN   NaN  left_only
1873           PR    total  1990          NaN   NaN  left_only
1874           PR    total  1991          NaN   NaN  left_only
1875           PR  under18  1991          NaN   NaN  left_only
1876           PR    total  1993          NaN   NaN  left_only
...           ...      ...   ...          ...   ...        ...
2203          USA    total  2010  309326295.0   NaN  left_only
2204          USA  under18  2011   73902222.0   NaN  left_only
2205          USA    total  2011  311582564.0   NaN  left_only
2206          USA  under18  2012   73708179.0   NaN  left_only
2207          USA    total  2012  313873685.0   NaN  left_only

[96 rows x 6 columns]

In [37]:
merged.groupby("_merge").count()

C:\Users\Jonatan\AppData\Local\Temp\ipykernel_7692\1046811352.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  merged.groupby("_merge").count()

            state/region  ages  year  population  state
_merge
left_only             96    96    96          76      0
right_only             0     0     0           0      0
both                2448  2448  2448        2448   2448

Parece que todos los valores nulos de población son de Puerto Rico anteriores al año 2000; esto se debe probablemente a que estos datos no están disponibles en la fuente original.

Y lo que es más importante, vemos también que algunas de las nuevas entradas ``state`` también son nulas, lo que significa que no había ninguna entrada correspondiente en la clave ``abbrevs``.
Averigüemos qué regiones carecen de esta coincidencia:

In [48]:
merged.loc[merged['state'].isnull(), 'state/region'].unique()

array(['PR', 'USA'], dtype=object)

Podemos deducir rápidamente el problema: nuestros datos de población incluyen entradas para Puerto Rico (PR) y los Estados Unidos en su conjunto (USA), mientras que estas entradas no aparecen en la clave de abreviatura del estado.
Podemos solucionarlo rápidamente introduciendo las entradas adecuadas:

In [49]:
merged.loc[merged['state/region'] == 'PR', 'state'] = 'Puerto Rico'
merged.loc[merged['state/region'] == 'USA', 'state'] = 'United States'
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state           False
_merge          False
dtype: bool

In [50]:
merged[merged['population'].isnull()]

     state/region     ages  year  population        state     _merge
1872           PR  under18  1990         NaN  Puerto Rico  left_only
1873           PR    total  1990         NaN  Puerto Rico  left_only
1874           PR    total  1991         NaN  Puerto Rico  left_only
1875           PR  under18  1991         NaN  Puerto Rico  left_only
1876           PR    total  1993         NaN  Puerto Rico  left_only
1877           PR  under18  1993         NaN  Puerto Rico  left_only
1878           PR  under18  1992         NaN  Puerto Rico  left_only
1879           PR    total  1992         NaN  Puerto Rico  left_only
1880           PR  under18  1994         NaN  Puerto Rico  left_only
1881           PR    total  1994         NaN  Puerto Rico  left_only
1882           PR    total  1995         NaN  Puerto Rico  left_only
1883           PR  under18  1995         NaN  Puerto Rico  left_only
1884           PR  under18  1996         NaN  Puerto Rico  left_only
1885           PR    total  1996         NaN  Puerto Rico  left_only
1886           PR  under18  1998         NaN  Puerto Rico  left_only
1887           PR    total  1998         NaN  Puerto Rico  left_only
1888           PR    total  1997         NaN  Puerto Rico  left_only
1889           PR  under18  1997         NaN  Puerto Rico  left_only
1890           PR    total  1999         NaN  Puerto Rico  left_only
1891           PR  under18  1999         NaN  Puerto Rico  left_only

In [51]:
merged = merged[merged["population"].notnull()]

In [52]:
merged[merged['population'].isnull()]

Empty DataFrame
Columns: [state/region, ages, year, population, state, _merge]
Index: []

In [53]:
merged.head()

  state/region     ages  year  population   state _merge
0           AK    total  1990    553290.0  Alaska   both
1           AK  under18  1990    177502.0  Alaska   both
2           AK    total  1992    588736.0  Alaska   both
3           AK  under18  1991    182180.0  Alaska   both
4           AK  under18  1992    184878.0  Alaska   both

Se acabaron los nulos en la columna ``state``: ¡listo!

Ahora podemos fusionar el resultado con los datos del área mediante un procedimiento similar.
Al examinar nuestros resultados, querremos unirlos en la columna ``state`` de ambos:

In [55]:
merged.rename(columns={"_merge":"merge_pop_abbrevs"}, inplace=True)
final = pd.merge(merged, areas, on='state', how='left', indicator=True)
final.head()

,state/region,ages,year,population,state,merge_pop_abbrevs,area (sq. mi),_merge
0,AK,total,1990,553290.0,Alaska,both,656425.0,both
1,AK,under18,1990,177502.0,Alaska,both,656425.0,both
2,AK,total,1992,588736.0,Alaska,both,656425.0,both
3,AK,under18,1991,182180.0,Alaska,both,656425.0,both
4,AK,under18,1992,184878.0,Alaska,both,656425.0,both

Breves notas sobre la igualdad entre dataframes

In [65]:
# NaN != NaN
(final != final).sum()

state/region          0
ages                  0
year                  0
population            0
state                 0
merge_pop_abbrevs     0
area (sq. mi)        48
_merge                0
dtype: int64

In [62]:
np.nan == np.nan

False

In [61]:
# Usamos el metodo equals.
# Más adelante veremos un ejemplo comparando dos dataframes distintos!
final.equals(final)

True

In [58]:
final.groupby('_merge')['_merge'].count()

C:\Users\Jonatan\AppData\Local\Temp\ipykernel_7692\3929008639.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  final.groupby('_merge')['_merge'].count()

_merge
left_only       48
right_only       0
both          2476
Name: _merge, dtype: int64

De nuevo, vamos a comprobar si hay nulos para ver si hay algún desajuste:

In [66]:
final.isnull().any()

state/region         False
ages                 False
year                 False
population           False
state                False
merge_pop_abbrevs    False
area (sq. mi)         True
_merge               False
dtype: bool

Hay nulos en la columna ``área``; podemos echar un vistazo para ver qué regiones se ignoraron aquí:

In [67]:
final[final["_merge"]!="both"]

,state/region,ages,year,population,state,merge_pop_abbrevs,area (sq. mi),_merge
2140,USA,under18,1990,64218512.0,United States,left_only,NaN,left_only
2141,USA,total,1990,249622814.0,United States,left_only,NaN,left_only
2142,USA,total,1991,252980942.0,United States,left_only,NaN,left_only
2143,USA,under18,1991,65313018.0,United States,left_only,NaN,left_only
2144,USA,under18,1992,66509177.0,United States,left_only,NaN,left_only
2145,USA,total,1992,256514231.0,United States,left_only,NaN,left_only
2146,USA,total,1993,259918595.0,United States,left_only,NaN,left_only
2147,USA,under18,1993,67594938.0,United States,left_only,NaN,left_only
2148,USA,under18,1994,68640936.0,United States,left_only,NaN,left_only
2149,USA,total,1994,263125826.0,United States,left_only,NaN,left_only
2150,USA,under18,1995,69473140.0,United States,left_only,NaN,left_only
2151,USA,under18,1996,70233512.0,United States,left_only,NaN,left_only
2152,USA,total,1995,266278403.0,United States,left_only,NaN,left_only
2153,USA,total,1996,269394291.0,United States,left_only,NaN,left_only
2154,USA,total,1997,272646932.0,United States,left_only,NaN,left_only
2155,USA,under18,1997,70920738.0,United States,left_only,NaN,left_only
2156,USA,under18,1998,71431406.0,United States,left_only,NaN,left_only
2157,USA,total,1998,275854116.0,United States,left_only,NaN,left_only
2158,USA,under18,1999,71946051.0,United States,left_only,NaN,left_only
2159,USA,total,2000,282162411.0,United States,left_only,NaN,left_only
2160,USA,under18,2000,72376189.0,United States,left_only,NaN,left_only
2161,USA,total,1999,279040181.0,United States,left_only,NaN,left_only
2162,USA,total,2001,284968955.0,United States,left_only,NaN,left_only
2163,USA,under18,2001,72671175.0,United States,left_only,NaN,left_only
2164,USA,total,2002,287625193.0,United States,left_only,NaN,left_only
2165,USA,under18,2002,72936457.0,United States,left_only,NaN,left_only
2166,USA,total,2003,290107933.0,United States,left_only,NaN,left_only
2167,USA,under18,2003,73100758.0,United States,left_only,NaN,left_only
2168,USA,total,2004,292805298.0,United States,left_only,NaN,left_only
2169,USA,under18,2004,73297735.0,United States,left_only,NaN,left_only
2170,USA,total,2005,295516599.0,United States,left_only,NaN,left_only
2171,USA,under18,2005,73523669.0,United States,left_only,NaN,left_only
2172,USA,total,2006,298379912.0,United States,left_only,NaN,left_only
2173,USA,under18,2006,73757714.0,United States,left_only,NaN,left_only
2174,USA,total,2007,301231207.0,United States,left_only,NaN,left_only
2175,USA,under18,2007,74019405.0,United States,left_only,NaN,left_only
2176,USA,total,2008,304093966.0,United States,left_only,NaN,left_only
2177,USA,under18,2008,74104602.0,United States,left_only,NaN,left_only
2178,USA,under18,2013,73585872.0,United States,left_only,NaN,left_only
2179,USA,total,2013,316128839.0,United States,left_only,NaN,left_only
2180,USA,total,2009,306771529.0,United States,left_only,NaN,left_only
2181,USA,under18,2009,74134167.0,United States,left_only,NaN,left_only
2182,USA,under18,2010,74119556.0,United States,left_only,NaN,left_only
2183,USA,total,2010,309326295.0,United States,left_only,NaN,left_only
2184,USA,under18,2011,73902222.0,United States,left_only,NaN,left_only
2185,USA,total,2011,311582564.0,United States,left_only,NaN,left_only
2186,USA,under18,2012,73708179.0,United States,left_only,NaN,left_only
2187,USA,total,2012,313873685.0,United States,left_only,NaN,left_only

In [68]:
final[final["_merge"]!="both"]['state/region'].unique()

array(['USA'], dtype=object)

In [69]:
areas

                   state  area (sq. mi)
0                Alabama          52423
1                 Alaska         656425
2                Arizona         114006
3               Arkansas          53182
4             California         163707
5               Colorado         104100
6            Connecticut           5544
7               Delaware           1954
8                Florida          65758
9                Georgia          59441
10                Hawaii          10932
11                 Idaho          83574
12              Illinois          57918
13               Indiana          36420
14                  Iowa          56276
15                Kansas          82282
16              Kentucky          40411
17             Louisiana          51843
18                 Maine          35387
19              Maryland          12407
20         Massachusetts          10555
21              Michigan          96810
22             Minnesota          86943
23           Mississippi          48434
24              Missouri          69709
25               Montana         147046
26              Nebraska          77358
27                Nevada         110567
28         New Hampshire           9351
29            New Jersey           8722
30            New Mexico         121593
31              New York          54475
32        North Carolina          53821
33          North Dakota          70704
34                  Ohio          44828
35              Oklahoma          69903
36                Oregon          98386
37          Pennsylvania          46058
38          Rhode Island           1545
39        South Carolina          32007
40          South Dakota          77121
41             Tennessee          42146
42                 Texas         268601
43                  Utah          84904
44               Vermont           9615
45              Virginia          42769
46            Washington          71303
47         West Virginia          24231
48             Wisconsin          65503
49               Wyoming          97818
50  District of Columbia             68
51           Puerto Rico           3515

In [74]:
final.loc[final["area (sq. mi)"].isnull(), "area (sq. mi)"] = areas[areas["state"]!="Puerto Rico"]["area (sq. mi)"].sum()

In [75]:
final.isnull().sum()

state/region         0
ages                 0
year                 0
population           0
state                0
merge_pop_abbrevs    0
area (sq. mi)        0
_merge               0
dtype: int64

Vemos que nuestro ``DataFrame`` de ``areas`` no contiene el área de Estados Unidos en su conjunto.
Podríamos insertar el valor apropiado (usando la suma de las áreas de todos los estados, por ejemplo), pero en este caso simplemente eliminaremos los valores nulos porque la densidad de población de todo Estados Unidos no es relevante para nuestra discusión actual:

In [76]:
final.dropna(inplace=True)
final.head()

,state/region,ages,year,population,state,merge_pop_abbrevs,area (sq. mi),_merge
0,AK,total,1990,553290.0,Alaska,both,656425.0,both
1,AK,under18,1990,177502.0,Alaska,both,656425.0,both
2,AK,total,1992,588736.0,Alaska,both,656425.0,both
3,AK,under18,1991,182180.0,Alaska,both,656425.0,both
4,AK,under18,1992,184878.0,Alaska,both,656425.0,both

Ahora tenemos todos los datos que necesitamos. Para responder a la pregunta que nos interesa, vamos a seleccionar primero la parte de los datos correspondiente al año 2000 y la población total.
Usaremos la función ``query()`` para hacerlo rápidamente (esto requiere tener instalado el paquete ``numexpr``:

In [77]:
data2010 = final[(final["year"] == 2010) & (final["ages"] == 'total')]
data2010.head()

,state/region,ages,year,population,state,merge_pop_abbrevs,area (sq. mi),_merge
43,AK,total,2010,713868.0,Alaska,both,656425.0,both
51,AL,total,2010,4785570.0,Alabama,both,52423.0,both
141,AR,total,2010,2922280.0,Arkansas,both,53182.0,both
149,AZ,total,2010,6408790.0,Arizona,both,114006.0,both
197,CA,total,2010,37333601.0,California,both,163707.0,both

In [83]:
data2010_q = final.query("year == 2010 & ages == 'total'")
data2010_q.head()

,state/region,ages,year,population,state,merge_pop_abbrevs,area (sq. mi),_merge
43,AK,total,2010,713868.0,Alaska,both,656425.0,both
51,AL,total,2010,4785570.0,Alabama,both,52423.0,both
141,AR,total,2010,2922280.0,Arkansas,both,53182.0,both
149,AZ,total,2010,6408790.0,Arizona,both,114006.0,both
197,CA,total,2010,37333601.0,California,both,163707.0,both

In [81]:
# limitaciones: nombres de las columnas con símbolos
#final.query("year == 2010 & state/region == 'AL'")
final.rename(columns={"state/region":"region"}).query("year == 2010 & region == 'AL'")

,region,ages,year,population,state,merge_pop_abbrevs,area (sq. mi),_merge
50,AL,under18,2010,1130966.0,Alabama,both,52423.0,both
51,AL,total,2010,4785570.0,Alabama,both,52423.0,both

In [84]:
data2010.equals(data2010_q)

True

In [86]:
data2010 == data2010_q

,state/region,ages,year,population,state,merge_pop_abbrevs,area (sq. mi),_merge
43,True,True,True,True,True,True,True,True
51,True,True,True,True,True,True,True,True
141,True,True,True,True,True,True,True,True
149,True,True,True,True,True,True,True,True
197,True,True,True,True,True,True,True,True
283,True,True,True,True,True,True,True,True
293,True,True,True,True,True,True,True,True
341,True,True,True,True,True,True,True,True
427,True,True,True,True,True,True,True,True
475,True,True,True,True,True,True,True,True
485,True,True,True,True,True,True,True,True
570,True,True,True,True,True,True,True,True
618,True,True,True,True,True,True,True,True
629,True,True,True,True,True,True,True,True
714,True,True,True,True,True,True,True,True
725,True,True,True,True,True,True,True,True
773,True,True,True,True,True,True,True,True
858,True,True,True,True,True,True,True,True
869,True,True,True,True,True,True,True,True
954,True,True,True,True,True,True,True,True
965,True,True,True,True,True,True,True,True
1050,True,True,True,True,True,True,True,True
1061,True,True,True,True,True,True,True,True
1146,True,True,True,True,True,True,True,True
1194,True,True,True,True,True,True,True,True
1205,True,True,True,True,True,True,True,True
1253,True,True,True,True,True,True,True,True
1338,True,True,True,True,True,True,True,True
1349,True,True,True,True,True,True,True,True
1434,True,True,True,True,True,True,True,True
1482,True,True,True,True,True,True,True,True
1493,True,True,True,True,True,True,True,True
1578,True,True,True,True,True,True,True,True
1589,True,True,True,True,True,True,True,True
1637,True,True,True,True,True,True,True,True
1722,True,True,True,True,True,True,True,True
1733,True,True,True,True,True,True,True,True
1818,True,True,True,True,True,True,True,True
1829,True,True,True,True,True,True,True,True
1894,True,True,True,True,True,True,True,True
1942,True,True,True,True,True,True,True,True
1953,True,True,True,True,True,True,True,True
2038,True,True,True,True,True,True,True,True
2049,True,True,True,True,True,True,True,True
2134,True,True,True,True,True,True,True,True
2183,True,True,True,True,True,True,True,True
2193,True,True,True,True,True,True,True,True
2241,True,True,True,True,True,True,True,True
2326,True,True,True,True,True,True,True,True
2374,True,True,True,True,True,True,True,True
2422,True,True,True,True,True,True,True,True
2433,True,True,True,True,True,True,True,True
2481,True,True,True,True,True,True,True,True

In [85]:
(data2010 != data2010_q).sum()

state/region         0
ages                 0
year                 0
population           0
state                0
merge_pop_abbrevs    0
area (sq. mi)        0
_merge               0
dtype: int64

In [87]:
# El orden importa en las comparaciones entre dataframes!!
data2010 = data2010.sample(frac=1,replace=False)
#(data2010 != data2010_q).sum()

In [88]:
data2010.equals(data2010_q)

False

Ahora vamos a calcular la densidad de población y mostrarla por orden.
Empezaremos por volver a indexar nuestros datos en el estado y, a continuación, calcularemos el resultado:

In [89]:
density = data2010['population'] / data2010['area (sq. mi)']
density.sort_values(ascending=False, inplace=True)
density.head()

341     8898.897059
1894    1058.665149
1493    1009.253268
1942     681.339159
293      645.600649
dtype: float64

In [90]:
data2010['density'] = data2010['population'] / data2010['area (sq. mi)']
data2010.sort_values(by=["density"],ascending=False, inplace=True)
data2010.head()

,state/region,ages,year,population,state,merge_pop_abbrevs,area (sq. mi),_merge,density
341,DC,total,2010,605125.0,District of Columbia,both,68.0,both,8898.897059
1894,PR,total,2010,3721208.0,Puerto Rico,left_only,3515.0,both,1058.665149
1493,NJ,total,2010,8802707.0,New Jersey,both,8722.0,both,1009.253268
1942,RI,total,2010,1052669.0,Rhode Island,both,1545.0,both,681.339159
293,CT,total,2010,3579210.0,Connecticut,both,5544.0,both,645.600649

El resultado es una clasificación de los estados de EE.UU. más Washington, DC, y Puerto Rico por orden de densidad de población en 2010, en residentes por milla cuadrada.
Podemos ver que, con diferencia, la región más densa en este conjunto de datos es Washington, DC (es decir, el Distrito de Columbia); entre los estados, el más denso es Nueva Jersey.

También podemos comprobar el final de la lista:

In [91]:
data2010.tail()

,state/region,ages,year,population,state,merge_pop_abbrevs,area (sq. mi),_merge,density
2038,SD,total,2010,816211.0,South Dakota,both,77121.0,both,10.583512
1349,ND,total,2010,674344.0,North Dakota,both,70704.0,both,9.537565
1253,MT,total,2010,990527.0,Montana,both,147046.0,both,6.736171
2481,WY,total,2010,564222.0,Wyoming,both,97818.0,both,5.768079
43,AK,total,2010,713868.0,Alaska,both,656425.0,both,1.087509

In [ ]:
density.tail()

Vemos que el estado menos denso, con diferencia, es Alaska, con una media de poco más de un residente por milla cuadrada.

Este tipo de fusión de datos desordenados es una tarea habitual cuando se intenta responder a preguntas utilizando fuentes de datos del mundo real.
Espero que este ejemplo te haya dado una idea de las formas en que puedes combinar las herramientas que hemos visto para obtener información de tus datos.